## Plan Result (test_apim_appgw)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.app-gw.azurerm_application_gateway.ag[0]
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.app-gw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw"
    }

  # module.app-gw.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw"
        name                              = "cft-apim00-perftest-agw"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "testing"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)

      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/frontendIPConfigurations/appGwPublicFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPublicFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/frontendPorts/https" -> null
          - frontend_port_name             = "https" -> null
          - host_name                      = "cft-mtls-api-mgmt-appgw.perftest.platform.hmcts.net" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/httpListeners/cft-mtls-api-mgmt-appgw" -> null
          - name                           = "cft-mtls-api-mgmt-appgw" -> null
          - protocol                       = "Https" -> null
          - require_sni                    = true -> null
          - ssl_certificate_id             = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/sslCertificates/wildcard-perftest-platform-hmcts-net" -> null
          - ssl_certificate_name           = "wildcard-perftest-platform-hmcts-net" -> null
          - ssl_profile_id                 = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/sslProfiles/default-ssl" -> null
          - ssl_profile_name               = "default-ssl" -> null
            # (1 unchanged attribute hidden)
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/frontendIPConfigurations/appGwPublicFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPublicFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/frontendPorts/https" -> null
          - frontend_port_name             = "https" -> null
          - host_name                      = "sdt.apps-nle.hmcts.net" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/httpListeners/civil-sdt" -> null
          - name                           = "civil-sdt" -> null
          - protocol                       = "Https" -> null
          - require_sni                    = false -> null
          - ssl_certificate_id             = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/sslCertificates/civil-sdt-nle" -> null
          - ssl_certificate_name           = "civil-sdt-nle" -> null
          - ssl_profile_id                 = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/sslProfiles/civil-sdt-sslprofile" -> null
          - ssl_profile_name               = "civil-sdt-sslprofile" -> null
            # (1 unchanged attribute hidden)
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/frontendIPConfigurations/appGwPublicFrontendIp" -> null
          - frontend_ip_configuration_name = "appGwPublicFrontendIp" -> null
          - frontend_port_id               = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/frontendPorts/https" -> null
          - frontend_port_name             = "https" -> null
          - host_name                      = "sdtcomm.apps-nle.hmcts.net" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/httpListeners/civil-sdt-commissioning" -> null
          - name                           = "civil-sdt-commissioning" -> null
          - protocol                       = "Https" -> null
          - require_sni                    = false -> null
          - ssl_certificate_id             = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/sslCertificates/civil-sdt-commissioning-nle" -> null
          - ssl_certificate_name           = "civil-sdt-commissioning-nle" -> null
          - ssl_profile_id                 = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/sslProfiles/civil-sdt-commissioning-sslprofile" -> null
          - ssl_profile_name               = "civil-sdt-commissioning-sslprofile" -> null
            # (1 unchanged attribute hidden)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "appGwPublicFrontendIp"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "https"
          + host_name                      = "cft-mtls-api-mgmt-appgw.perftest.platform.hmcts.net"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "cft-mtls-api-mgmt-appgw"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "wildcard-perftest-platform-hmcts-net"
          + ssl_profile_id                 = (known after apply)
          + ssl_profile_name               = "cft-mtls-api-mgmt-appgw-sslprofile"
            # (1 unchanged attribute hidden)
        }
      + http_listener {
          + frontend_ip_configuration_id   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/frontendIPConfigurations/appGwPublicFrontendIp"
          + frontend_ip_configuration_name = "appGwPublicFrontendIp"
          + frontend_port_id               = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/frontendPorts/https"
          + frontend_port_name             = "https"
          + host_name                      = "sdt.apps-nle.hmcts.net"
          + host_names                     = []
          + id                             = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/httpListeners/civil-sdt"
          + name                           = "civil-sdt"
          + protocol                       = "Https"
          + ssl_certificate_id             = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/sslCertificates/civil-sdt-nle"
          + ssl_certificate_name           = "civil-sdt-nle"
          + ssl_profile_id                 = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/sslProfiles/civil-sdt-sslprofile"
          + ssl_profile_name               = "civil-sdt-sslprofile"
        }
      + http_listener {
          + frontend_ip_configuration_id   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/frontendIPConfigurations/appGwPublicFrontendIp"
          + frontend_ip_configuration_name = "appGwPublicFrontendIp"
          + frontend_port_id               = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/frontendPorts/https"
          + frontend_port_name             = "https"
          + host_name                      = "sdtcomm.apps-nle.hmcts.net"
          + host_names                     = []
          + id                             = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/httpListeners/civil-sdt-commissioning"
          + name                           = "civil-sdt-commissioning"
          + protocol                       = "Https"
          + ssl_certificate_id             = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/sslCertificates/civil-sdt-commissioning-nle"
          + ssl_certificate_name           = "civil-sdt-commissioning-nle"
          + ssl_profile_id                 = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/sslProfiles/civil-sdt-commissioning-sslprofile"
          + ssl_profile_name               = "civil-sdt-commissioning-sslprofile"
        }

      - request_routing_rule {
          - backend_address_pool_id     = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendAddressPools/cft-mtls-api-mgmt-appgw-address-pool" -> null
          - backend_address_pool_name   = "cft-mtls-api-mgmt-appgw-address-pool" -> null
          - backend_http_settings_id    = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendHttpSettingsCollection/cft-mtls-api-mgmt-appgw-http-settings" -> null
          - backend_http_settings_name  = "cft-mtls-api-mgmt-appgw-http-settings" -> null
          - http_listener_id            = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/httpListeners/cft-mtls-api-mgmt-appgw" -> null
          - http_listener_name          = "cft-mtls-api-mgmt-appgw" -> null
          - id                          = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/requestRoutingRules/cft-mtls-api-mgmt-appgw" -> null
          - name                        = "cft-mtls-api-mgmt-appgw" -> null
          - priority                    = 10 -> null
          - rewrite_rule_set_id         = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/rewriteRuleSets/rewrite" -> null
          - rewrite_rule_set_name       = "rewrite" -> null
          - rule_type                   = "Basic" -> null
            # (4 unchanged attributes hidden)
        }
      - request_routing_rule {
          - backend_address_pool_id     = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendAddressPools/civil-sdt-address-pool" -> null
          - backend_address_pool_name   = "civil-sdt-address-pool" -> null
          - backend_http_settings_id    = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendHttpSettingsCollection/civil-sdt-http-settings" -> null
          - backend_http_settings_name  = "civil-sdt-http-settings" -> null
          - http_listener_id            = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/httpListeners/civil-sdt" -> null
          - http_listener_name          = "civil-sdt" -> null
          - id                          = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/requestRoutingRules/civil-sdt" -> null
          - name                        = "civil-sdt" -> null
          - priority                    = 30 -> null
          - rewrite_rule_set_id         = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/rewriteRuleSets/civil-sdt-rewriterule" -> null
          - rewrite_rule_set_name       = "civil-sdt-rewriterule" -> null
          - rule_type                   = "Basic" -> null
            # (4 unchanged attributes hidden)
        }
      - request_routing_rule {
          - backend_address_pool_id     = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendAddressPools/civil-sdt-commissioning-address-pool" -> null
          - backend_address_pool_name   = "civil-sdt-commissioning-address-pool" -> null
          - backend_http_settings_id    = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendHttpSettingsCollection/civil-sdt-commissioning-http-settings" -> null
          - backend_http_settings_name  = "civil-sdt-commissioning-http-settings" -> null
          - http_listener_id            = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/httpListeners/civil-sdt-commissioning" -> null
          - http_listener_name          = "civil-sdt-commissioning" -> null
          - id                          = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/requestRoutingRules/civil-sdt-commissioning" -> null
          - name                        = "civil-sdt-commissioning" -> null
          - priority                    = 20 -> null
          - rewrite_rule_set_id         = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/rewriteRuleSets/civil-sdt-commissioning-rewriterule" -> null
          - rewrite_rule_set_name       = "civil-sdt-commissioning-rewriterule" -> null
          - rule_type                   = "Basic" -> null
            # (4 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendAddressPools/civil-sdt-address-pool"
          + backend_address_pool_name  = "civil-sdt-address-pool"
          + backend_http_settings_id   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendHttpSettingsCollection/civil-sdt-http-settings"
          + backend_http_settings_name = "civil-sdt-http-settings"
          + http_listener_id           = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/httpListeners/civil-sdt"
          + http_listener_name         = "civil-sdt"
          + id                         = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/requestRoutingRules/civil-sdt"
          + name                       = "civil-sdt"
          + priority                   = 30
          + rewrite_rule_set_id        = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/rewriteRuleSets/civil-sdt-rewriterule"
          + rewrite_rule_set_name      = "civil-sdt-rewriterule"
          + rule_type                  = "Basic"
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendAddressPools/civil-sdt-commissioning-address-pool"
          + backend_address_pool_name  = "civil-sdt-commissioning-address-pool"
          + backend_http_settings_id   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/backendHttpSettingsCollection/civil-sdt-commissioning-http-settings"
          + backend_http_settings_name = "civil-sdt-commissioning-http-settings"
          + http_listener_id           = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/httpListeners/civil-sdt-commissioning"
          + http_listener_name         = "civil-sdt-commissioning"
          + id                         = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/requestRoutingRules/civil-sdt-commissioning"
          + name                       = "civil-sdt-commissioning"
          + priority                   = 20
          + rewrite_rule_set_id        = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/rewriteRuleSets/civil-sdt-commissioning-rewriterule"
          + rewrite_rule_set_name      = "civil-sdt-commissioning-rewriterule"
          + rule_type                  = "Basic"
            # (2 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "cft-mtls-api-mgmt-appgw-address-pool"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "cft-mtls-api-mgmt-appgw-http-settings"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "cft-mtls-api-mgmt-appgw"
          + id                          = (known after apply)
          + name                        = "cft-mtls-api-mgmt-appgw"
          + priority                    = 10
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "Basic"
          + url_path_map_id             = (known after apply)
            # (3 unchanged attributes hidden)
        }

      - rewrite_rule_set {
          - id   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/rewriteRuleSets/rewrite" -> null
          - name = "rewrite" -> null

          - rewrite_rule {
              - name          = "NewRewrite" -> null
              - rule_sequence = 100 -> null

              - request_header_configuration {
                  - header_name  = "X-ARR-ClientCertThumbprint" -> null
                  - header_value = "{var_client_certificate_fingerprint}" -> null
                }
              - request_header_configuration {
                  - header_name  = "X-ARR-ClientCertStartDate" -> null
                  - header_value = "{var_client_certificate_start_date}" -> null
                }
              - request_header_configuration {
                  - header_name  = "X-ARR-ClientCertStartDate" -> null
                  - header_value = "{var_client_certificate_end_date}" -> null
                }
            }
        }

      ~ ssl_profile {
            id                                   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/sslProfiles/civil-sdt-commissioning-sslprofile"
          ~ name                                 = "civil-sdt-commissioning-sslprofile" -> "cft-mtls-api-mgmt-appgw-sslprofile"
          ~ trusted_client_certificate_names     = [
              ~ "civil-sdt-commissioning-trusted-cert" -> "cft-mtls-api-mgmt-appgw-trusted-cert",
            ]
            # (2 unchanged attributes hidden)
        }
      ~ ssl_profile {
            id                                   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/sslProfiles/civil-sdt-sslprofile"
          ~ name                                 = "civil-sdt-sslprofile" -> "civil-sdt-commissioning-sslprofile"
          ~ trusted_client_certificate_names     = [
              ~ "civil-sdt-trusted-cert" -> "civil-sdt-commissioning-trusted-cert",
            ]
            # (2 unchanged attributes hidden)
        }
      ~ ssl_profile {
            id                                   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/sslProfiles/default-ssl"
          ~ name                                 = "default-ssl" -> "civil-sdt-sslprofile"
          ~ trusted_client_certificate_names     = [
              ~ "test" -> "civil-sdt-trusted-cert",
            ]
            # (2 unchanged attributes hidden)
        }

      ~ trusted_client_certificate {
          ~ data = (sensitive value)
            id   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/trustedClientCertificates/civil-sdt-commissioning-trusted-cert"
          ~ name = "civil-sdt-commissioning-trusted-cert" -> "cft-mtls-api-mgmt-appgw-trusted-cert"
        }
      ~ trusted_client_certificate {
            id   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/trustedClientCertificates/civil-sdt-trusted-cert"
          ~ name = "civil-sdt-trusted-cert" -> "civil-sdt-commissioning-trusted-cert"
            # (1 unchanged attribute hidden)
        }
      ~ trusted_client_certificate {
          ~ data = (sensitive value)
            id   = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw/trustedClientCertificates/test"
          ~ name = "test" -> "civil-sdt-trusted-cert"
        }

        # (24 unchanged blocks hidden)
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                             = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/applicationGateways/cft-apim00-perftest-agw|AppGw"
        name                           = "AppGw"
        # (5 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":2152,"Program":"tfcmt","SHA1":"","Target":"test_apim_appgw","Vars":{}} -->